#Створити програму, яка дозволяє знаходити числа Фібоначчі по індексу.
#Програма приймає вхідним аргументом індекс бажаного числа. Потім саме число Фібоначчі
#обчислюється і виводиться як результат.
#Числа Фібоначчі - це ряд, в якому кожне наступне число рівне сумі двох попередніх.


fib1 = 1
fib2 = 1

n = input("Номер бажаного елемента ряду Фібаначчі: ")
n = int(n)

i = 0
while i < n - 2:
    fib_sum = fib1 + fib2
    fib1 = fib2
    fib2 = fib_sum
    i = i + 1

print(fib2)
