#Реалізувати програму, яка приймає на вхід два чи більше масивів випадкових цілих чисел випадкової довжини і обєднує їх в один масив та виводить його на екран. 
#При цьому результуючий масив повинен відповідати наступним вимогам:
#•	Масив посортований по зростанню значень елементів.
#•	Масив містить тільки унікальні числа, які не кратні числу 5.




n = int(input())   # Кількість масивів які приймає програма

arr = [[] for _ in range(n)]   # Двохвимірний масив який буде містити дані масиви
arrf = []                      # Масив в якому будуть поєднані дані масиви
arrRes = []


for i in range(n):
    s = input()
    arr[i] = [int(x) for x in s.split()]    # Считування масивів
    s = 0

    arrf += arr[i]  # Об'єднання даних масивів в один

arrf.sort()

for x in arrf:
    if x % 5 != 0:  # Видалення чисел кратних 5
        arrRes.append(x)

print(arrRes)
