#Реалізувати програму, яка дозволяє виводити N-ий рядок трикутника Паскаля.
#1.	Додаток повинен приймати на вхід номер рядка і на виході вивести рядок трикутника Паскаля.
#2.	При цьому рядок потрібно розрахувати без створення повного трикутника. Тобто не можна спочатку створити весь трикутник від 1-шо до N-го рядка, а потім тільки вивести N-ий рядок.



def pascaline(n):
    n -= 1
    line = [1]
    for k in range(max(n, 0)):
        line.append(line[k] * (n - k) // (k + 1))
    print(line)


inp = int(input())  # Ввід номера рядка

pascaline(inp)  # Активаці функції
